1. Create a pandas DataFrame 'df' which is filled with the values from 'islands',
has 'names1' as columns and 
'names2' as row label. 
Name the rows 'continents' and 
the columns 'categories'.

In [2]:
import pandas as pd
import numpy as np

islands = {'Insel':['Kap Verde','Kap Verde','Kap Verde','Fidschi','Fidschi','Fidschi','Skye','Skye','Skye'],
        'Year':[2005,2010,2015,2005,2010,2015,2005,2010,2015],
        'Population':[471000,509000,546000,837000,876000,910000,10300,10500,10800],
        'Capital':['Praia','Praia','Praia','Suva','Suva','Suva','Portree','Portree','Portree'],
        'Tourists':[1312,1231,5623,5423,5421,4355,4532,2345,3342]}
names1 = ['Island','Year','Population','Capital','Tourists']
names2 = ['Afrika','Afrika','Afrika','Australia','Australia','Australia', 'Europe','Europe','Europe']

2. Print the column and row labels

In [5]:
df = pd.DataFrame(islands)
df

       Insel  Year  Population  Capital  Tourists
0  Kap Verde  2005      471000    Praia      1312
1  Kap Verde  2010      509000    Praia      1231
2  Kap Verde  2015      546000    Praia      5623
3    Fidschi  2005      837000     Suva      5423
4    Fidschi  2010      876000     Suva      5421
5    Fidschi  2015      910000     Suva      4355
6       Skye  2005       10300  Portree      4532
7       Skye  2010       10500  Portree      2345
8       Skye  2015       10800  Portree      3342

3. Check if 'timezone' is a column in 'df'

In [8]:
'timezone' in df.columns

False

4. Check if 'Australia' can be found in the rows

In [10]:
'Australia' in df.index

False

5. Create a pandas Series 'ser' with values from 0 to 9 and the with the index 'a' to 'j'. Filter the series for the index 'f'. Try accessing the element on two ways.

In [22]:
ser = pd.Series(range(10),index=['a','b','c','d','e','f','g','h','i','j'])
ser['f']
ser.iloc[5]

5

6. Print the values four to seven from 'ser'

In [24]:
ser.iloc[3:7]

d    3
e    4
f    5
g    6
dtype: int64

7. Print the values of the indexes 'e','i','c' and 'j'

In [ ]:
ser[['e','i','c','j']]

8. Print the values 'g' to 'i'

In [25]:
ser['g':'i']

g    6
h    7
i    8
dtype: int64

9. Print all values that are greater than 6

In [28]:
ser[ser>6]

b    10
c    11
d    12
e    13
h     7
i     8
j     9
dtype: int64

10. Replace the values with the index 'b' to 'e' with the numbers '10' to '13'

In [27]:
ser['b':'e'] = [10,11,12,13]
ser

a     0
b    10
c    11
d    12
e    13
f     5
g     6
h     7
i     8
j     9
dtype: int64

11. Print the columns 'one' and 'four' from the dataframe 'df'

In [37]:
df = pd.DataFrame(np.random.randint(1, 81 ,16).reshape((4,4)),index =['Kap Verde', 'Fidschi', 'Skye', 'Hawaii'], 
                     columns=['one','two','three','four'])

df[['one','four']]

           one  four
Kap Verde   34    75
Fidschi     71    20
Skye        49    48
Hawaii      15    31

12. Only print the Rows which have values greater than 30 in column 'two'

In [38]:
df[df['two']>30]

           one  two  three  four
Kap Verde   34   36     17    75
Fidschi     71   39      3    20
Skye        49   47     33    48

13. Create a boolean table which returns True for values greater than '10'

In [39]:
df>10

            one   two  three  four
Kap Verde  True  True   True  True
Fidschi    True  True  False  True
Skye       True  True   True  True
Hawaii     True  True   True  True

14. Print the element from 'df' that is in row 'Fidschi' and in column 'four'

In [40]:
df.loc['Fidschi','four']

20

15. Print all elements of 'df' that are in the rows 'Fidschi' and 'Skye' and in the columns 'one' and 'four'

In [41]:
df.loc[['Fidschi','Skye'],['one','four']]

         one  four
Fidschi   71    20
Skye      49    48

16. Print all elements of 'df' in row 1 and 2 and in column 0 and 3

In [42]:
df.iloc[[0,1],[0,2]]

         one  four
Fidschi   71    20
Skye      49    48

17. Sort 'df' after the row index

In [ ]:
 df.sort_index(axis=0)

18. Sort 'df' after the column index

In [ ]:
 df.sort_index(axis=1)

19. Sort 'df' after the values in column 'three'

In [43]:
df.sort_values(by='three')

           one  two  three  four
Fidschi     71   39      3    20
Kap Verde   34   36     17    75
Skye        49   47     33    48
Hawaii      15   24     38    31

20. Sort 'df' first after the values in colum 'three' and then after column 'one'

In [45]:
df.sort_values(by=['three','one'])

           one  two  three  four
Fidschi     71   39      3    20
Kap Verde   34   36     17    75
Skye        49   47     33    48
Hawaii      15   24     38    31

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

21. Add 'frame1' and 'frame2'. Check the 'NaN'-Values

In [50]:
frame1 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Skye', 'Fidschi', 'Hawaii'])

frame2 = pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Skye', 'Kap Verde', 'Fidschi'])

22. Add the two dataframes using the add() function and fill missing values with '0' and save it in 'frame3'

In [51]:
df = frame1.add(frame2, fill_value=0)

In [52]:
df

             b     c     d
Fidschi    9.0  11.0  13.0
Hawaii     6.0   7.0   8.0
Kap Verde  3.0   4.0   5.0
Skye       0.0   2.0   4.0

23. Subtract the row with the index 'Fidschi' from 'frame3' from all elements in 'frame3' and save it in 'frame4'

In [56]:
frame4 = df - df.iloc[0]

In [57]:
frame4

             b    c    d
Fidschi    0.0  0.0  0.0
Hawaii    -3.0 -4.0 -5.0
Kap Verde -6.0 -7.0 -8.0
Skye      -9.0 -9.0 -9.0

24. Convert all values of 'frame5' to positive numbers

In [60]:
frame5 = pd.DataFrame({'a':[0.234,-1.432,6.753,-9.653],'b':[2.521,-4.349,5.323,4.024],'c':[0.231,-0.986,3.821,-7.424]}
                      , index=['one','two','three','four'])
frame5.abs()

           a      b      c
one    0.234  2.521  0.231
two    1.432  4.349  0.986
three  6.753  5.323  3.821
four   9.653  4.024  7.424

25. Apply function f on all rows in 'frame6'

In [61]:
frame6 = pd.DataFrame({'a':[1,2,3,4],'b':[2,2,2,2],'c':[3,3,3,3]}, index=['eins','zwei','drei','vier'])

f = lambda x: x - 2

frame6.apply(f)

      a  b  c
eins -1  0  1
zwei  0  0  1
drei  1  0  1
vier  2  0  1

26. Import the CSV file 'AppBewertungen.csv' as a dataframe.

In [67]:
dataframe= pd.read_csv('AppBewertungen.csv',sep=';')
dataframe

,Datum,Land,Bewertung,Kommentar
0,11.11.2018,DE,5,Dies ist eine sehr gute App
1,12.11.2018,EN,1,The App crashes on iPhone6
2,12.11.2018,DE,3,NaN
3,13.11.2018,FR,5,Tres bien
4,14.11.2018,DE,2,Die App gefällt mir garnicht
5,11.10.2018,SW,4,Bra App!
6,12.11.2018,DE,4,Anfangs ist die Appp nicht gerade übersichtlic...
7,12.11.2018,EN,5,"Yes, best App ever"
8,14.11.2018,EN,5,I was waiting for this App so long
9,11.11.2018,DE,1,Nicht ganz so gelungen

27. Import the CSV file 'AppBewertungen.csv' as a dataframe and ignore the header.

In [69]:
dataframe = pd.read_csv('AppBewertungen.csv', sep =";", header=None)
dataframe

,0,1,2,3
0,Datum,Land,Bewertung,Kommentar
1,11.11.2018,DE,5,Dies ist eine sehr gute App
2,12.11.2018,EN,1,The App crashes on iPhone6
3,12.11.2018,DE,3,NaN
4,13.11.2018,FR,5,Tres bien
5,14.11.2018,DE,2,Die App gefällt mir garnicht
6,11.10.2018,SW,4,Bra App!
7,12.11.2018,DE,4,Anfangs ist die Appp nicht gerade übersichtlic...
8,12.11.2018,EN,5,"Yes, best App ever"
9,14.11.2018,EN,5,I was waiting for this App so long
10,11.11.2018,DE,1,Nicht ganz so gelungen

28. Import the CSV file 'AppBewertungen.csv' and set the column 'Datum' as the index

In [72]:
dataframe = pd.read_csv('AppBewertungen.csv', sep =";",index_col='Datum')
dataframe

,Land,Bewertung,Kommentar
Datum,,,
11.11.2018,DE,5,Dies ist eine sehr gute App
12.11.2018,EN,1,The App crashes on iPhone6
12.11.2018,DE,3,NaN
13.11.2018,FR,5,Tres bien
14.11.2018,DE,2,Die App gefällt mir garnicht
11.10.2018,SW,4,Bra App!
12.11.2018,DE,4,Anfangs ist die Appp nicht gerade übersichtlic...
12.11.2018,EN,5,"Yes, best App ever"
14.11.2018,EN,5,I was waiting for this App so long
11.11.2018,DE,1,Nicht ganz so gelungen